test/BFS/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0      3.0     0)  
    (0      4.0     0)  
    (2.0    1.0     0)
    (2.0    2.0     0)
    (2.0    3.0     0)
    (2.0    4.0     0)
    (3.0    0       0)
    (3.0    1.0     0)
    (3.0    2.0     0)
    (3.0    3.0     0)
    (3.0    4.0     0)
    (40.0   0       0)
    (40.0   1.0     0)
    (40.0   2.0     0)
    
    (0      3.0     0.1)  
    (0      4.0     0.1)  
    (2.0    1.0     0.1)
    (2.0    2.0     0.1)
    (2.0    3.0     0.1)
    (2.0    4.0     0.1)
    (3.0    0       0.1)
    (3.0    1.0     0.1)
    (3.0    2.0     0.1)
    (3.0    3.0     0.1)
    (3.0    4.0     0.1)
    (40.0   0       0.1)
    (40.0   1.0     0.1)
    (40.0   2.0     0.1)

);

blocks
(
    hex (0 4 5 1  14 18 19 15) (20 20 1) simpleGrading (1 1 1)
    hex (4 9 10 5  18 22 23 19) (100 20 1) simpleGrading (2.0 1 1)
    hex (3 8 9 4  17 21 22 18) (100 20 1) simpleGrading (2.0 1 1)
    hex (2 7 8 3  16 20 21 17) (100 20 1) simpleGrading (2.0 1 1)
    hex (7 12 13 8  20 24 25 21) (100 20 1) simpleGrading (2.0 1 1)
    hex (6 11 12 7  19 23 24 20) (100 20 1) simpleGrading (2.0 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 14 15 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 13 25 24)
            (11 12 24 23)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (1 15 19 5)
            (5 19 23 10)
            (4 18 14 0)
            (8 9 22 21)
            (8 21 25 13)
            (3 17 18 4)
            (2 16 17 3)
            (2 7 20 16)
            (6 19 20 7)
            (6 11 23 19)
            (9 10 23 22)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (4 5 10 9)
            (3 4 9 8)
            (2 3 8 7)
            (7 8 13 12)
            (6 7 12 11)
            (14 18 19 15)
            (18 22 23 19)
            (17 21 22 18)
            (16 20 21 17)
            (20 24 25 21)
            (19 23 24 20)    
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
